#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
; shader debug name: bd08814935d14c186fe7de05948969a7.pdb
; shader hash: bd08814935d14c186fe7de05948969a7
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer RootConstants
; {
;
;   struct dx.alignment.legacy.RootConstants
;   {
;
;       column_major float4x4 modelViewMatrix;        ; Offset:    0
;       column_major float4x4 projectionMatrix;       ; Offset:   64
;   
;   } RootConstants;                                  ; Offset:    0 Size:   128
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !20)
!1 = !DIFile(filename: "depth_pre_pass.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "vs", scope: !1, file: !1, line: 32, type: !18, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @vs)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !4}
!20 = !{!21, !43}
!21 = !DIGlobalVariable(name: "modelViewMatrix", linkageName: "\01?modelViewMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 28, type: !22, isLocal: false, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 28, size: 512, align: 32, elements: !23, templateParams: !40)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !22, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!40 = !{!13, !41, !42}
!41 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!42 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!43 = !DIGlobalVariable(name: "projectionMatrix", linkageName: "\01?projectionMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 29, type: !22, isLocal: false, isDefinition: true)
!44 = !{i32 2, !"Dwarf Version", i32 4}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!47 = !{!"depth_pre_pass.hlsl", !"/*\0D\0A===========================================================================\0D\0ACopyright (C) 2023 Gian 'myT' Schellenbaum\0D\0A\0D\0AThis file is part of Challenge Quake 3 (CNQ3).\0D\0A\0D\0AChallenge Quake 3 is free software; you can redistribute it\0D\0Aand/or modify it under the terms of the GNU General Public License as\0D\0Apublished by the Free Software Foundation; either version 2 of the License,\0D\0Aor (at your option) any later version.\0D\0A\0D\0AChallenge Quake 3 is distributed in the hope that it will be useful,\0D\0Abut WITHOUT ANY WARRANTY; without even the implied warranty of\0D\0AMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\0D\0AGNU General Public License for more details.\0D\0A\0D\0AYou should have received a copy of the GNU General Public License\0D\0Aalong with Challenge Quake 3. If not, see <https://www.gnu.org/licenses/>.\0D\0A===========================================================================\0D\0A*/\0D\0A// depth pre-pass\0D\0A\0D\0A\0D\0A#if VERTEX_SHADER\0D\0A\0D\0Acbuffer RootConstants\0D\0A{\0D\0A\09matrix modelViewMatrix;\0D\0A\09matrix projectionMatrix;\0D\0A};\0D\0A\0D\0Afloat4 vs(float4 position : POSITION) : SV_Position\0D\0A{\0D\0A\09float4 positionVS = mul(modelViewMatrix, float4(position.xyz, 1));\0D\0A\0D\0A\09return mul(projectionMatrix, positionVS);\0D\0A}\0D\0A\0D\0A#endif\0D\0A\0D\0A\0D\0A#if PIXEL_SHADER\0D\0A\0D\0Avoid ps()\0D\0A{\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!48 = !{!"VERTEX_SHADER=1", !"VERTEX_SHADER=1"}
!49 = !{!"depth_pre_pass.hlsl"}
!50 = !{!"-E", !"vs", !"-T", !"vs_6_0", !"-WX", !"-Ges", !"-Gis", !"-Zi", !"-Qembed_debug", !"-D", !"VERTEX_SHADER=1", !"-D", !"VERTEX_SHADER=1"}
!51 = !{i32 1, i32 0}
!52 = !{i32 1, i32 6}
!53 = !{!"vs", i32 6, i32 0}
!54 = !{null, null, !55, null}
!55 = !{!56}
!56 = !{i32 0, %dx.alignment.legacy.RootConstants* undef, !"RootConstants", i32 0, i32 0, i32 1, i32 128, null}
!57 = !{i32 0, %RootConstants undef, !58, %dx.alignment.legacy.RootConstants undef, !58}
!58 = !{i32 128, !59, !61}
!59 = !{i32 6, !"modelViewMatrix", i32 2, !60, i32 3, i32 0, i32 7, i32 9}
!60 = !{i32 4, i32 4, i32 2}
!61 = !{i32 6, !"projectionMatrix", i32 2, !60, i32 3, i32 64, i32 7, i32 9}
!62 = !{i32 1, void ()* @vs, !63}
!63 = !{!64}
!64 = !{i32 0, !2, !2}
!65 = !{[6 x i32] [i32 4, i32 4, i32 15, i32 15, i32 15, i32 0]}
!66 = !{void ()* @vs, !"vs", !67, !54, null}
!67 = !{!68, !72, null}
!68 = !{!69}
!69 = !{i32 0, !"POSITION", i8 9, i8 0, !70, i8 0, i32 1, i8 4, i32 0, i8 0, !71}
!70 = !{i32 0}
!71 = !{i32 3, i32 7}
!72 = !{!73}
!73 = !{i32 0, !"SV_Position", i8 9, i8 3, !70, i8 4, i32 1, i8 4, i32 0, i8 0, !74}
!74 = !{i32 3, i32 15}
!75 = !{i32 1}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "position", arg: 1, scope: !17, file: !1, line: 32, type: !4)
!77 = !DIExpression(DW_OP_bit_piece, 0, 32)
!78 = !DILocation(line: 32, column: 18, scope: !17)
!79 = !DIExpression(DW_OP_bit_piece, 32, 32)
!80 = !DIExpression(DW_OP_bit_piece, 64, 32)
!81 = !DILocation(line: 34, column: 26, scope: !17)
!82 = !DILocation(line: 34, column: 22, scope: !17)
!83 = !DILocation(line: 36, column: 13, scope: !17)
!84 = !DILocation(line: 36, column: 9, scope: !17)
!85 = !DILocation(line: 36, column: 2, scope: !17)

#endif

const unsigned char g_vs[] = {
