#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; COLOR                    0   xyzw        3     NONE   float   xyzw
; TEXCOORD                 1   xyz         4     NONE   float   xyz 
; TEXCOORD                 2   xyz         5     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 7835576a368c4028cdaf572ccd92503a.pdb
; shader hash: 7835576a368c4028cdaf572ccd92503a
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
; COLOR                    0                 linear       
; TEXCOORD                 1                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !50)
!1 = !DIFile(filename: "dynamic_light.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 86, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 86, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 82, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 82, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 82, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 82, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25, !43, !47}
!25 = !DISubprogram(name: "ps", scope: !1, file: !1, line: 98, type: !26, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @ps)
!26 = !DISubroutineType(types: !27)
!27 = !{!4, !28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 36, size: 608, align: 32, elements: !29)
!29 = !{!30, !31, !32, !40, !41, !42}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !28, file: !1, line: 38, baseType: !4, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !28, file: !1, line: 39, baseType: !16, size: 96, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !28, file: !1, line: 40, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 86, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 86, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !28, file: !1, line: 41, baseType: !4, size: 128, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "osLightVec", scope: !28, file: !1, line: 42, baseType: !16, size: 96, align: 32, offset: 416)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "osEyeVec", scope: !28, file: !1, line: 43, baseType: !16, size: 96, align: 32, offset: 512)
!43 = !DISubprogram(name: "MakeGreyscale", linkageName: "\01?MakeGreyscale@@YA?AV?$vector@M$03@@V1@M@Z", scope: !44, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DIFile(filename: "./shared.hlsli", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !4, !8}
!47 = !DISubprogram(name: "BezierEase", linkageName: "\01?BezierEase@@YAMM@Z", scope: !1, file: !1, line: 92, type: !48, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!8, !8}
!50 = !{!51, !63, !65, !67, !68, !69, !70, !77}
!51 = !DIGlobalVariable(name: "stageIndices", linkageName: "\01?stageIndices@RootConstants@@3V?$vector@I$03@@B", scope: !0, file: !1, line: 81, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 81, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 81, size: 128, align: 32, elements: !55, templateParams: !61)
!55 = !{!56, !58, !59, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 81, baseType: !57, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 81, baseType: !57, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !54, file: !1, line: 81, baseType: !57, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !54, file: !1, line: 81, baseType: !57, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !{!62, !14}
!62 = !DITemplateTypeParameter(name: "element", type: !57)
!63 = !DIGlobalVariable(name: "color", linkageName: "\01?color@RootConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 82, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!65 = !DIGlobalVariable(name: "recSqrRadius", linkageName: "\01?recSqrRadius@RootConstants@@3MB", scope: !0, file: !1, line: 83, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!67 = !DIGlobalVariable(name: "greyscale", linkageName: "\01?greyscale@RootConstants@@3MB", scope: !0, file: !1, line: 84, type: !66, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "intensity", linkageName: "\01?intensity@RootConstants@@3MB", scope: !0, file: !1, line: 85, type: !66, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "opaque", linkageName: "\01?opaque@RootConstants@@3MB", scope: !0, file: !1, line: 86, type: !66, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "textures2D", linkageName: "\01?textures2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 89, type: !71, isLocal: false, isDefinition: true, variable: [4096 x %"class.Texture2D<vector<float, 4> >"]* @"\01?textures2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 655360, align: 32, elements: !75)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !5)
!75 = !{!76}
!76 = !DISubrange(count: 4096)
!77 = !DIGlobalVariable(name: "samplers", linkageName: "\01?samplers@@3PAUSamplerState@@A", scope: !0, file: !1, line: 90, type: !78, isLocal: false, isDefinition: true, variable: [96 x %struct.SamplerState]* @"\01?samplers@@3PAUSamplerState@@A")
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 3072, align: 32, elements: !80)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!80 = !{!81}
!81 = !DISubrange(count: 96)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
