#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; COLOR                    0   xyzw        3     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; COLOR                    0   xyzw        3     NONE   float   xyzw
; TEXCOORD                 1   xyz         4     NONE   float   xyz 
; TEXCOORD                 2   xyz         5     NONE   float   xyz 
;
; shader debug name: b87baa2a3dc5d347fe46c172ff8921ad.pdb
; shader hash: b87baa2a3dc5d347fe46c172ff8921ad
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !49)
!1 = !DIFile(filename: "dynamic_light.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 53, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 53, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 53, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "vs", scope: !1, file: !1, line: 57, type: !18, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @vs)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !43}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 36, size: 608, align: 32, elements: !21)
!21 = !{!22, !23, !32, !40, !41, !42}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 38, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !1, line: 39, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 54, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 54, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !20, file: !1, line: 40, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 54, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 54, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 41, baseType: !4, size: 128, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "osLightVec", scope: !20, file: !1, line: 42, baseType: !24, size: 96, align: 32, offset: 416)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "osEyeVec", scope: !20, file: !1, line: 43, baseType: !24, size: 96, align: 32, offset: 512)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VIn", file: !1, line: 26, size: 384, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !1, line: 28, baseType: !24, size: 96, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !43, file: !1, line: 29, baseType: !24, size: 96, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !43, file: !1, line: 30, baseType: !33, size: 64, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !43, file: !1, line: 31, baseType: !4, size: 128, align: 32, offset: 256)
!49 = !{!50, !72, !73, !75}
!50 = !DIGlobalVariable(name: "modelViewMatrix", linkageName: "\01?modelViewMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 51, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 51, size: 512, align: 32, elements: !52, templateParams: !69)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !51, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!69 = !{!13, !70, !71}
!70 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!71 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!72 = !DIGlobalVariable(name: "projectionMatrix", linkageName: "\01?projectionMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 52, type: !51, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "osLightPos", linkageName: "\01?osLightPos@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 53, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!75 = !DIGlobalVariable(name: "osEyePos", linkageName: "\01?osEyePos@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 54, type: !74, isLocal: false, isDefinition: true)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
