#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; DEPTHVS                  0     z         1     NONE   float     z 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 488833dd0a5d7e2506596862e1167884.pdb
; shader hash: 488833dd0a5d7e2506596862e1167884
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; DEPTHVS                  0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer RootConstants
; {
;
;   struct RootConstants
;   {
;
;       float4 colorDepth;                            ; Offset:    0
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !46)
!1 = !DIFile(filename: "fog_outside.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 32, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 32, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 62, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 62, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 62, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 62, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 62, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 62, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!25 = !{!26, !42}
!26 = !DISubprogram(name: "ps", scope: !1, file: !1, line: 30, type: !27, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @ps)
!27 = !DISubroutineType(types: !28)
!28 = !{!14, !29}
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !30, line: 24, size: 224, align: 32, elements: !31)
!30 = !DIFile(filename: "./fog.hlsli", directory: "")
!31 = !{!32, !33, !41}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !29, file: !30, line: 26, baseType: !14, size: 128, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "proj2232", scope: !29, file: !30, line: 27, baseType: !34, size: 64, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 62, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 62, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 62, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 62, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!23, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "depthVS", scope: !29, file: !30, line: 28, baseType: !18, size: 32, align: 32, offset: 192)
!42 = !DISubprogram(name: "LinearDepth", linkageName: "\01?LinearDepth@@YAMMMM@Z", scope: !43, file: !43, line: 45, type: !44, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DIFile(filename: "./shared.hlsli", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!18, !18, !18, !18}
!46 = !{!47, !49}
!47 = !DIGlobalVariable(name: "colorDepth", linkageName: "\01?colorDepth@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !30, line: 62, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!49 = !DIGlobalVariable(name: "depthTexture", linkageName: "\01?depthTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !30, line: 65, type: !50, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?depthTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 65, size: 160, align: 32, elements: !2, templateParams: !51)
!51 = !{!52}
!52 = !DITemplateTypeParameter(name: "element", type: !15)
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!56 = !{!"fog_outside.hlsl", !"/*\0D\0A===========================================================================\0D\0ACopyright (C) 2023 Gian 'myT' Schellenbaum\0D\0A\0D\0AThis file is part of Challenge Quake 3 (CNQ3).\0D\0A\0D\0AChallenge Quake 3 is free software; you can redistribute it\0D\0Aand/or modify it under the terms of the GNU General Public License as\0D\0Apublished by the Free Software Foundation; either version 2 of the License,\0D\0Aor (at your option) any later version.\0D\0A\0D\0AChallenge Quake 3 is distributed in the hope that it will be useful,\0D\0Abut WITHOUT ANY WARRANTY; without even the implied warranty of\0D\0AMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\0D\0AGNU General Public License for more details.\0D\0A\0D\0AYou should have received a copy of the GNU General Public License\0D\0Aalong with Challenge Quake 3. If not, see <https://www.gnu.org/licenses/>.\0D\0A===========================================================================\0D\0A*/\0D\0A// fog volume (AABB) seen from outside\0D\0A\0D\0A\0D\0A#include \22shared.hlsli\22\0D\0A#include \22fog.hlsli\22\0D\0A\0D\0A\0D\0A#ifdef PIXEL_SHADER\0D\0A\0D\0Afloat4 ps(VOut input) : SV_Target\0D\0A{\0D\0A\09float zwDepth = depthTexture.Load(int3(input.position.xy, 0)).x;\0D\0A\09float depthBuff = LinearDepth(zwDepth, input.proj2232.x, input.proj2232.y);\0D\0A\09float depthFrag = input.depthVS;\0D\0A\09if(depthFrag > depthBuff)\0D\0A\09{\0D\0A\09\09discard;\0D\0A\09}\0D\0A\0D\0A\09float fogOpacity = saturate((depthBuff - depthFrag) / colorDepth.w);\0D\0A\0D\0A\09return float4(colorDepth.rgb, fogOpacity);\0D\0A\0D\0A\09// depth test debugging\0D\0A\09//return depthFrag <= depthBuff ? float4(0, 1, 0, 1) : float4(1, 0, 0, 1);\0D\0A\0D\0A\09// depth linearization debugging\0D\0A\09//return float4(0, abs(depthBuff - depthFrag) < 1 ? 1 : 0, 0, 1);\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
