#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; DEPTHVS                  0     z         1     NONE   float     z 
;
; shader debug name: 9d1fafe0e2194156948c24bf6a73b892.pdb
; shader hash: 9d1fafe0e2194156948c24bf6a73b892
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; DEPTHVS                  0                 linear       
;
; Buffer Definitions:
;
; cbuffer RootConstants
; {
;
;   struct dx.alignment.legacy.RootConstants
;   {
;
;       column_major float4x4 modelViewMatrix;        ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !41)
!1 = !DIFile(filename: "fog_inside.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 38, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 38, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 39, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 39, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24}
!24 = !DISubprogram(name: "vs", scope: !25, file: !25, line: 42, type: !26, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @vs)
!25 = !DIFile(filename: "./fog.hlsli", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !33}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !25, line: 24, size: 224, align: 32, elements: !29)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !28, file: !25, line: 26, baseType: !4, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "proj2232", scope: !28, file: !25, line: 27, baseType: !16, size: 64, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "depthVS", scope: !28, file: !25, line: 28, baseType: !8, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 39, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 39, size: 96, align: 32, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!41 = !{!42, !64, !65, !67}
!42 = !DIGlobalVariable(name: "modelViewMatrix", linkageName: "\01?modelViewMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !25, line: 36, type: !43, isLocal: false, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 36, size: 512, align: 32, elements: !44, templateParams: !61)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !43, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!61 = !{!13, !62, !63}
!62 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!63 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!64 = !DIGlobalVariable(name: "projectionMatrix", linkageName: "\01?projectionMatrix@RootConstants@@3V?$matrix@M$03$03@@A", scope: !0, file: !25, line: 37, type: !43, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariable(name: "boxMin", linkageName: "\01?boxMin@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !25, line: 38, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!67 = !DIGlobalVariable(name: "boxMax", linkageName: "\01?boxMax@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !25, line: 39, type: !66, isLocal: false, isDefinition: true)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!71 = !{!"fog_inside.hlsl", !"/*\0D\0A===========================================================================\0D\0ACopyright (C) 2023 Gian 'myT' Schellenbaum\0D\0A\0D\0AThis file is part of Challenge Quake 3 (CNQ3).\0D\0A\0D\0AChallenge Quake 3 is free software; you can redistribute it\0D\0Aand/or modify it under the terms of the GNU General Public License as\0D\0Apublished by the Free Software Foundation; either version 2 of the License,\0D\0Aor (at your option) any later version.\0D\0A\0D\0AChallenge Quake 3 is distributed in the hope that it will be useful,\0D\0Abut WITHOUT ANY WARRANTY; without even the implied warranty of\0D\0AMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\0D\0AGNU General Public License for more details.\0D\0A\0D\0AYou should have received a copy of the GNU General Public License\0D\0Aalong with Challenge Quake 3. If not, see <https://www.gnu.org/licenses/>.\0D\0A===========================================================================\0D\0A*/\0D\0A// fog volume (AABB) seen from inside\0D\0A\0D\0A\0D\0A#include \22shared.hlsli\22\0D\0A#include \22fog.hlsli\22\0D\0A\0D\0A\0D\0A#if PIXEL_SHADER\0D\0A\0D\0Afloat4 ps(VOut input) : SV_Target\0D\0A{\0D\0A\09float zwDepth = depthTexture.Load(int3(input.position.xy, 0)).x;\0D\0A\09float depthBuff = LinearDepth(zwDepth, input.proj2232.x, input.proj2232.y);\0D\0A\09float depthFrag = input.depthVS;\0D\0A\09float depth = min(depthBuff, depthFrag);\0D\0A\09float fogOpacity = saturate(depth / colorDepth.w);\0D\0A\0D\0A\09return float4(colorDepth.rgb, fogOpacity);\0D\0A\0D\0A\09// depth test debugging\0D\0A\09//return depthFrag <= depthBuff ? float4(0, 1, 0, 1) : float4(1, 0, 0, 1);\0D\0A\0D\0A\09// depth linearization debugging\0D\0A\09//return float4(0, abs(depthBuff - depthFrag) < 1 ? 1 : 0, 0, 1);\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
