#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: d7047cf78be34918514b98d7537306da.pdb
; shader hash: d7047cf78be34918514b98d7537306da
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "imgui.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 36, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 36, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "vs", scope: !1, file: !1, line: 46, type: !18, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @vs)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 24, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 26, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !20, file: !1, line: 27, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 28, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VIn", file: !1, line: 39, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 41, baseType: !25, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !32, file: !1, line: 42, baseType: !4, size: 128, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 43, baseType: !25, size: 64, align: 32, offset: 192)
!37 = !{!38}
!38 = !DIGlobalVariable(name: "projectionMatrix", linkageName: "\01?projectionMatrix@RootConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 36, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 36, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 36, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!13, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!65 = !{!"imgui.hlsl", !"/*\0D\0A===========================================================================\0D\0ACopyright (C) 2023 Gian 'myT' Schellenbaum\0D\0A\0D\0AThis file is part of Challenge Quake 3 (CNQ3).\0D\0A\0D\0AChallenge Quake 3 is free software; you can redistribute it\0D\0Aand/or modify it under the terms of the GNU General Public License as\0D\0Apublished by the Free Software Foundation; either version 2 of the License,\0D\0Aor (at your option) any later version.\0D\0A\0D\0AChallenge Quake 3 is distributed in the hope that it will be useful,\0D\0Abut WITHOUT ANY WARRANTY; without even the implied warranty of\0D\0AMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\0D\0AGNU General Public License for more details.\0D\0A\0D\0AYou should have received a copy of the GNU General Public License\0D\0Aalong with Challenge Quake 3. If not, see <https://www.gnu.org/licenses/>.\0D\0A===========================================================================\0D\0A*/\0D\0A// Dear ImGui integration\0D\0A\0D\0A\0D\0Astruct VOut\0D\0A{\0D\0A\09float4 pos : SV_POSITION;\0D\0A\09float4 col : COLOR0;\0D\0A\09float2 uv : TEXCOORD0;\0D\0A};\0D\0A\0D\0A\0D\0A#if VERTEX_SHADER\0D\0A\0D\0Acbuffer RootConstants\0D\0A{\0D\0A\09float4x4 projectionMatrix;\0D\0A};\0D\0A\0D\0Astruct VIn\0D\0A{\0D\0A\09float2 pos : POSITION;\0D\0A\09float4 col : COLOR0;\0D\0A\09float2 uv : TEXCOORD0;\0D\0A};\0D\0A\0D\0AVOut vs(VIn input)\0D\0A{\0D\0A\09VOut output;\0D\0A\09output.pos = mul(projectionMatrix, float4(input.pos.xy, 0.0, 1.0));\0D\0A\09output.col = input.col;\0D\0A\09output.uv = input.uv;\0D\0A\0D\0A\09return output;\0D\0A}\0D\0A\0D\0A#endif\0D\0A\0D\0A\0D\0A#if PIXEL_SHADER\0D\0A\0D\0Acbuffer RootConstants\0D\0A{\0D\0A\09uint textureIndex;\0D\0A\09uint samplerIndex;\0D\0A\09float mipIndex;\0D\0A};\0D\0A\0D\0ASamplerState samplers[12] : register(s0);\0D\0ATexture2D textures[4096] : register(t0);\0D\0A\0D\0Afloat4 ps(VOut input) : SV_Target\0D\0A{\0D\0A\09return input.col * textures[textureIndex].SampleLevel(samplers[samplerIndex], input.uv, mipIndex);\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!66 = !{!"VERTEX_SHADER=1", !"VERTEX_SHADER=1"}
!67 = !{!"imgui.hlsl"}
!68 = !{!"-E", !"vs", !"-T", !"vs_6_0", !"-WX", !"-Ges", !"-Gis", !"-Zi", !"-Qembed_debug", !"-D", !"VERTEX_SHADER=1", !"-D", !"VERTEX_SHADER=1"}
!69 = !{i32 1, i32 0}
!70 = !{i32 1, i32 6}
!71 = !{!"vs", i32 6, i32 0}
!72 = !{null, null, !73, null}
!73 = !{!74}
!74 = !{i32 0, %dx.alignment.legacy.RootConstants* undef, !"RootConstants", i32 0, i32 0, i32 1, i32 64, null}
!75 = !{i32 0, %struct.VOut undef, !76, %struct.VIn undef, !80, %RootConstants undef, !82, %dx.alignment.legacy.RootConstants undef, !82}
!76 = !{i32 40, !77, !78, !79}
!77 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!78 = !{i32 6, !"col", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!79 = !{i32 6, !"uv", i32 3, i32 32, i32 4, !"TEXCOORD0", i32 7, i32 9}
!80 = !{i32 40, !81, !78, !79}
!81 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!82 = !{i32 64, !83}
!83 = !{i32 6, !"projectionMatrix", i32 2, !84, i32 3, i32 0, i32 7, i32 9}
!84 = !{i32 4, i32 4, i32 2}
!85 = !{i32 1, void ()* @vs, !86}
!86 = !{!87}
!87 = !{i32 0, !2, !2}
!88 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 0, i32 0, i32 16, i32 32, i32 64, i32 128, i32 256, i32 512]}
!89 = !{void ()* @vs, !"vs", !90, !72, null}
!90 = !{!91, !98, null}
!91 = !{!92, !95, !97}
!92 = !{i32 0, !"POSITION", i8 9, i8 0, !93, i8 0, i32 1, i8 2, i32 0, i8 0, !94}
!93 = !{i32 0}
