#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 1fdde2bfe9a970c8333c347783497011.pdb
; shader hash: 1fdde2bfe9a970c8333c347783497011
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer RootConstants
; {
;
;   struct RootConstants
;   {
;
;       float4 rtMetrics;                             ; Offset:    0
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !65)
!1 = !DIFile(filename: "smaa_3.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !26, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool4", file: !1, line: 1302, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 4>", file: !1, line: 1302, size: 128, align: 32, elements: !18, templateParams: !24)
!18 = !{!19, !21, !22, !23}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 1302, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 1302, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 1302, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !17, file: !1, line: 1302, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!24 = !{!25, !14}
!25 = !DITemplateTypeParameter(name: "element", type: !20)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool2", file: !1, line: 1303, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 2>", file: !1, line: 1303, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 1303, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 1303, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!25, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !32}
!39 = !{!40, !48, !55, !60}
!40 = !DISubprogram(name: "ps", scope: !1, file: !1, line: 63, type: !41, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @ps)
!41 = !DISubroutineType(types: !42)
!42 = !{!4, !43}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 31, size: 320, align: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !1, line: 33, baseType: !4, size: 128, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !43, file: !1, line: 34, baseType: !33, size: 64, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !43, file: !1, line: 35, baseType: !4, size: 128, align: 32, offset: 192)
!48 = !DISubprogram(name: "SMAANeighborhoodBlendingPS", linkageName: "\01?SMAANeighborhoodBlendingPS@@YA?AV?$vector@M$03@@V?$vector@M$01@@V1@V?$Texture2D@V?$vector@M$03@@@@2@Z", scope: !49, file: !49, line: 1269, type: !50, isLocal: false, isDefinition: true, scopeLine: 1276, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DIFile(filename: "./smaa.hlsli", directory: "")
!50 = !DISubroutineType(types: !51)
!51 = !{!4, !33, !4, !52, !52}
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 60, size: 160, align: 32, elements: !2, templateParams: !53)
!53 = !{!54}
!54 = !DITemplateTypeParameter(name: "element", type: !5)
!55 = !DISubprogram(name: "SMAAMovc", linkageName: "\01?SMAAMovc@@YAXV?$vector@_N$03@@AIAV?$vector@M$03@@V2@@Z", scope: !49, file: !49, line: 649, type: !56, isLocal: false, isDefinition: true, scopeLine: 649, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !16, !58, !4}
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4)
!60 = !DISubprogram(name: "SMAAMovc", linkageName: "\01?SMAAMovc@@YAXV?$vector@_N$01@@AIAV?$vector@M$01@@V2@@Z", scope: !49, file: !49, line: 644, type: !61, isLocal: false, isDefinition: true, scopeLine: 644, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !26, !63, !33}
!63 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !33)
!65 = !{!66, !68, !70, !71, !72}
!66 = !DIGlobalVariable(name: "rtMetrics", linkageName: "\01?rtMetrics@RootConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 26, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!68 = !DIGlobalVariable(name: "LinearSampler", linkageName: "\01?LinearSampler@@3USamplerState@@A", scope: !0, file: !49, line: 560, type: !69, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearSampler@@3USamplerState@@A")
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 560, size: 32, align: 32, elements: !2)
!70 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !49, line: 561, type: !69, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "inputTex", linkageName: "\01?inputTex@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 60, type: !52, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?inputTex@@3V?$Texture2D@V?$vector@M$03@@@@A")
!72 = !DIGlobalVariable(name: "blendTex", linkageName: "\01?blendTex@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 61, type: !52, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?blendTex@@3V?$Texture2D@V?$vector@M$03@@@@A")
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
