#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1     zw        1     NONE   float     zw
; TEXCOORD                 2   xyzw        2     NONE   float   xyzw
; TEXCOORD                 3   xyzw        3     NONE   float   xyzw
; TEXCOORD                 4   xyzw        4     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: a162077e9b72cc4253389df37da86bf3.pdb
; shader hash: a162077e9b72cc4253389df37da86bf3
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       
; TEXCOORD                 2                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !103)
!1 = !DIFile(filename: "smaa_2.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24, !8, !30, !38}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 1212, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 1212, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 1212, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 1212, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !15)
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !23}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool2", file: !1, line: 970, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 2>", file: !1, line: 970, size: 64, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 970, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 970, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !{!37, !23}
!37 = !DITemplateTypeParameter(name: "element", type: !34)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 1189, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 1189, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 1189, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 1189, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 1189, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !{!47, !59, !66, !69, !74, !77, !80, !83, !84, !87, !90, !93, !94, !97, !100, !101, !102}
!47 = !DISubprogram(name: "ps", scope: !1, file: !1, line: 65, type: !48, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @ps)
!48 = !DISubroutineType(types: !49)
!49 = !{!4, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 31, size: 640, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !50, file: !1, line: 33, baseType: !4, size: 128, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !50, file: !1, line: 34, baseType: !24, size: 64, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pixCoords", scope: !50, file: !1, line: 35, baseType: !24, size: 64, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !50, file: !1, line: 36, baseType: !56, size: 384, align: 32, offset: 256)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 3)
!59 = !DISubprogram(name: "SMAABlendingWeightCalculationPS", linkageName: "\01?SMAABlendingWeightCalculationPS@@YA?AV?$vector@M$03@@V?$vector@M$01@@0Y02V1@V?$Texture2D@V?$vector@M$03@@@@22V1@@Z", scope: !60, file: !60, line: 1162, type: !61, isLocal: false, isDefinition: true, scopeLine: 1168, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DIFile(filename: "./smaa.hlsli", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!4, !24, !24, !56, !63, !63, !63, !4}
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 61, size: 160, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "element", type: !5)
!66 = !DISubprogram(name: "SMAACalculateDiagWeights", linkageName: "\01?SMAACalculateDiagWeights@@YA?AV?$vector@M$01@@V?$Texture2D@V?$vector@M$03@@@@0V1@1V?$vector@M$03@@@Z", scope: !60, file: !60, line: 936, type: !67, isLocal: false, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!24, !63, !63, !24, !24, !4}
!69 = !DISubprogram(name: "SMAASearchDiag1", linkageName: "\01?SMAASearchDiag1@@YA?AV?$vector@M$01@@V?$Texture2D@V?$vector@M$03@@@@V1@1AIAV1@@Z", scope: !60, file: !60, line: 879, type: !70, isLocal: false, isDefinition: true, scopeLine: 879, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!24, !63, !24, !24, !72}
!72 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !24)
!74 = !DISubprogram(name: "SMAADecodeDiagBilinearAccess", linkageName: "\01?SMAADecodeDiagBilinearAccess@@YA?AV?$vector@M$03@@V1@@Z", scope: !60, file: !60, line: 871, type: !75, isLocal: false, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!4, !4}
!77 = !DISubprogram(name: "SMAAMovc", linkageName: "\01?SMAAMovc@@YAXV?$vector@_N$01@@AIAV?$vector@M$01@@V2@@Z", scope: !60, file: !60, line: 644, type: !78, isLocal: false, isDefinition: true, scopeLine: 644, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !30, !72, !24}
!80 = !DISubprogram(name: "SMAAAreaDiag", linkageName: "\01?SMAAAreaDiag@@YA?AV?$vector@M$01@@V?$Texture2D@V?$vector@M$03@@@@V1@1M@Z", scope: !60, file: !60, line: 917, type: !81, isLocal: false, isDefinition: true, scopeLine: 917, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!24, !63, !24, !24, !8}
!83 = !DISubprogram(name: "SMAASearchDiag2", linkageName: "\01?SMAASearchDiag2@@YA?AV?$vector@M$01@@V?$Texture2D@V?$vector@M$03@@@@V1@1AIAV1@@Z", scope: !60, file: !60, line: 891, type: !70, isLocal: false, isDefinition: true, scopeLine: 891, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubprogram(name: "SMAADecodeDiagBilinearAccess", linkageName: "\01?SMAADecodeDiagBilinearAccess@@YA?AV?$vector@M$01@@V1@@Z", scope: !60, file: !60, line: 853, type: !85, isLocal: false, isDefinition: true, scopeLine: 853, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!24, !24}
!87 = !DISubprogram(name: "SMAASearchXLeft", linkageName: "\01?SMAASearchXLeft@@YAMV?$Texture2D@V?$vector@M$03@@@@0V?$vector@M$01@@M@Z", scope: !60, file: !60, line: 1036, type: !88, isLocal: false, isDefinition: true, scopeLine: 1036, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!8, !63, !63, !24, !8}
