#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
; shader debug name: 5c14ea0242cd9fa8afb6b030704eca80.pdb
; shader hash: 5c14ea0242cd9fa8afb6b030704eca80
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "ui.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 36, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 36, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "vs", scope: !1, file: !1, line: 46, type: !18, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @vs)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VOut", file: !1, line: 24, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 26, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !20, file: !1, line: 27, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 28, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VIn", file: !1, line: 39, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !1, line: 41, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "texCoords", scope: !32, file: !1, line: 42, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !32, file: !1, line: 43, baseType: !4, size: 128, align: 32, offset: 128)
!37 = !{!38}
!38 = !DIGlobalVariable(name: "scale", linkageName: "\01?scale@RootConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 36, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!43 = !{!"ui.hlsl", !"/*\0D\0A===========================================================================\0D\0ACopyright (C) 2023 Gian 'myT' Schellenbaum\0D\0A\0D\0AThis file is part of Challenge Quake 3 (CNQ3).\0D\0A\0D\0AChallenge Quake 3 is free software; you can redistribute it\0D\0Aand/or modify it under the terms of the GNU General Public License as\0D\0Apublished by the Free Software Foundation; either version 2 of the License,\0D\0Aor (at your option) any later version.\0D\0A\0D\0AChallenge Quake 3 is distributed in the hope that it will be useful,\0D\0Abut WITHOUT ANY WARRANTY; without even the implied warranty of\0D\0AMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\0D\0AGNU General Public License for more details.\0D\0A\0D\0AYou should have received a copy of the GNU General Public License\0D\0Aalong with Challenge Quake 3. If not, see <https://www.gnu.org/licenses/>.\0D\0A===========================================================================\0D\0A*/\0D\0A// UI rendering\0D\0A\0D\0A\0D\0Astruct VOut\0D\0A{\0D\0A\09float4 position : SV_Position;\0D\0A\09float2 texCoords : TEXCOORD0;\0D\0A\09float4 color : COLOR0;\0D\0A};\0D\0A\0D\0A\0D\0A#if VERTEX_SHADER\0D\0A\0D\0Acbuffer RootConstants\0D\0A{\0D\0A\09float2 scale;\0D\0A};\0D\0A\0D\0Astruct VIn\0D\0A{\0D\0A\09float2 position : POSITION;\0D\0A\09float2 texCoords : TEXCOORD0;\0D\0A\09float4 color : COLOR0;\0D\0A};\0D\0A\0D\0AVOut vs(VIn input)\0D\0A{\0D\0A\09const float2 position = input.position * scale;\0D\0A\09VOut output;\0D\0A\09output.position = float4(position.x - 1.0, 1.0 - position.y, 0.0, 1.0);\0D\0A\09output.texCoords = input.texCoords;\0D\0A\09output.color = input.color;\0D\0A\0D\0A\09return output;\0D\0A}\0D\0A\0D\0A#endif\0D\0A\0D\0A\0D\0A#if PIXEL_SHADER\0D\0A\0D\0Acbuffer RootConstants\0D\0A{\0D\0A\09uint textureIndex;\0D\0A\09uint samplerIndex;\0D\0A};\0D\0A\0D\0ATexture2D textures2D[4096] : register(t0);\0D\0ASamplerState samplers[12] : register(s0);\0D\0A\0D\0Afloat4 ps(VOut input) : SV_Target\0D\0A{\0D\0A\09return textures2D[textureIndex].Sample(samplers[samplerIndex], input.texCoords) * input.color;\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!44 = !{!"VERTEX_SHADER=1", !"VERTEX_SHADER=1"}
!45 = !{!"ui.hlsl"}
!46 = !{!"-E", !"vs", !"-T", !"vs_6_0", !"-WX", !"-Ges", !"-Gis", !"-Zi", !"-Qembed_debug", !"-D", !"VERTEX_SHADER=1", !"-D", !"VERTEX_SHADER=1"}
!47 = !{i32 1, i32 0}
!48 = !{i32 1, i32 6}
!49 = !{!"vs", i32 6, i32 0}
!50 = !{null, null, !51, null}
!51 = !{!52}
!52 = !{i32 0, %RootConstants* undef, !"RootConstants", i32 0, i32 0, i32 1, i32 8, null}
!53 = !{i32 0, %struct.VOut undef, !54, %struct.VIn undef, !58, %RootConstants undef, !62}
!54 = !{i32 48, !55, !56, !57}
!55 = !{i32 6, !"position", i32 3, i32 0, i32 4, !"SV_Position", i32 7, i32 9}
!56 = !{i32 6, !"texCoords", i32 3, i32 16, i32 4, !"TEXCOORD0", i32 7, i32 9}
!57 = !{i32 6, !"color", i32 3, i32 32, i32 4, !"COLOR0", i32 7, i32 9}
!58 = !{i32 32, !59, !60, !61}
!59 = !{i32 6, !"position", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!60 = !{i32 6, !"texCoords", i32 3, i32 8, i32 4, !"TEXCOORD0", i32 7, i32 9}
!61 = !{i32 6, !"color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!62 = !{i32 8, !63}
!63 = !{i32 6, !"scale", i32 3, i32 0, i32 7, i32 9}
!64 = !{i32 1, void ()* @vs, !65}
!65 = !{!66}
!66 = !{i32 0, !2, !2}
!67 = !{[14 x i32] [i32 12, i32 12, i32 1, i32 2, i32 0, i32 0, i32 16, i32 32, i32 0, i32 0, i32 256, i32 512, i32 1024, i32 2048]}
